
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Swift 和函数式编程的遗产 · iOS 教程, iOS Tutorial</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Alex Tse">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="swift-gallagher-value-semantics.html" />
    
    
    <link rel="prev" href="../swift.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://xiemin.me" target="_blank" class="custom-link">Alex Tse</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../function.html">
            
                <a href="../function.html">
            
                    
                    Function
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../function/real-time-communication-with-streams-tutorial-for-ios.html">
            
                <a href="../function/real-time-communication-with-streams-tutorial-for-ios.html">
            
                    
                    iOS 实时流通讯
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../swift.html">
            
                <a href="../swift.html">
            
                    
                    Swift
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="tryswift-rob-napier-swift-legacy-functional-programming.html">
            
                <a href="tryswift-rob-napier-swift-legacy-functional-programming.html">
            
                    
                    Swift 和函数式编程的遗产
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="swift-gallagher-value-semantics.html">
            
                <a href="swift-gallagher-value-semantics.html">
            
                    
                    值语义(不是值类型)
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Swift 和函数式编程的遗产</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="swift-&#x548C;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x9057;&#x4EA7;">Swift &#x548C;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x9057;&#x4EA7;</h1>
<p><a href="https://academy.realm.io/posts/tryswift-rob-napier-swift-legacy-functional-programming/" target="_blank">&#x539F;&#x6587;&#x5730;&#x5740;</a></p>
<p>&#x4F5C;&#x8005;&#xFF1A;Rob Napier</p>
<p>&#x7FFB;&#x8BD1;&#x4E8E;&#xFF1A;2016/12</p>
<p>&#x8BD1;&#x6587;&#x5DF2;&#x5728; Realm &#x53D1;&#x5E03;&#xFF0C;<a href="https://academy.realm.io/cn/posts/tryswift-rob-napier-swift-legacy-functional-programming/" target="_blank">&#x70B9;&#x51FB;&#x67E5;&#x770B;</a></p>
<hr>
<p>Rob Napier &#x5F00;&#x53D1;&#x8FC7;&#x5355;&#x5B50;(Monad)&#xFF0C;Functor of Doom&#x3002; &#x4ED6;&#x63A5;&#x89E6;&#x8FC7; map&#xFF0C;flattened &#x548C; lensed&#x3002;&#x4ED6;&#x53CD;&#x590D;&#x8FED;&#x4EE3;&#x5C1D;&#x8BD5;&#xFF0C;&#x63D0;&#x51FA;&#x4E86; Maybe &#x7C7B;&#x578B;&#xFF0C;&#x4ECA;&#x540E;&#x4ED6;&#x4E5F;&#x5C06;&#x7EE7;&#x7EED;&#x81F4;&#x529B;&#x4E8E;&#x5BF9;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x63A2;&#x7D22;&#x3002;
&#x4ED6;&#x4ECE; Haskell &#x5230; Church&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#xFF1A;Swift &#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5982;&#x679C;&#x786C;&#x628A;&#x5B83;&#x4EEC;&#x5F53;&#x6210;&#x4E00;&#x56DE;&#x4E8B;&#x53CD;&#x800C;&#x4F1A;&#x6270;&#x4E71; Swift &#x548C;&#x7834;&#x574F; Cocoa&#x3002;
&#x7136;&#x800C;&#xFF0C;Swift &#x5374;&#x5DF2;&#x7ECF;&#x4ECE;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#x5438;&#x53D6;&#x4E86;&#x4E00;&#x4E9B;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x867D;&#x7136;&#x503C;&#x7C7B;&#x578B;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5F53;&#x524D;&#x6240;&#x6D41;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x663E;&#x7136;&#x662F;&#x672A;&#x6765;&#x8D8B;&#x52BF;&#x3002; 
Rob &#x7814;&#x7A76;&#x7740;&#x5DF2;&#x7ECF;&#x6709;&#x6570;&#x5341;&#x5E74;&#x7684;&#x51FD;&#x6570;&#x8BED;&#x8A00;&#x662F;&#x5982;&#x4F55;&#x5BF9; Swift &#x4EA7;&#x751F;&#x4E86;&#x5F71;&#x54CD;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x7684;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x4FDD;&#x6301; Swift &#x7684;&#x4E2A;&#x6027;&#x548C; Cocoa &#x7684;&#x53CB;&#x597D;&#xFF0C;&#x5F53;&#x7136;&#x5C11;&#x4E0D;&#x4E86;&#x8981;&#x62E5;&#x62B1;&#x9762;&#x5411;&#x534F;&#x8BAE;&#x7F16;&#x7A0B;&#x3002;</p>
<hr>
<h3 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h3>
<p>Swift &#x9762;&#x4E16;&#x4E00;&#x5468;&#x540E;&#xFF0C;&#x6211;&#x5199;&#x4E86;<a href="http://robnapier.net/swift-is-not-functional" target="_blank">&#x201C;Swift&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x51FD;&#x6570;&#x8BED;&#x8A00;&#x201D;</a>&#x8FD9;&#x7BC7;&#x535A;&#x5BA2;&#x3002;&#x4E24;&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;Swift &#x4F9D;&#x65E7;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#x8BED;&#x8A00;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x662F;&#x7ECF;&#x5386;&#x4E86;&#x6570;&#x5341;&#x8F7D;&#x7684;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#xFF0C;&#x4EE5;&#x66F4; Swifty &#x65B9;&#x5F0F;&#x5E26;&#x5230; Swift &#x91CC;&#x53BB;&#x3002;</p>
<p><strong>&#x4EC0;&#x4E48;&#x662F;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#xFF1F;</strong></p>
<p>&#x5B83;&#x662F;&#x5355;&#x5B50;(monads)&#xFF0C;&#x51FD;&#x5B50;(functors)&#xFF0C;Haskell &#x8FD9;&#x7C7B;&#x4F18;&#x7F8E;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x6216;&#x8BED;&#x6CD5;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x6765;&#x601D;&#x8003;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#x5728; Monad &#x51FA;&#x6765;&#x7684;&#x524D;&#x51E0;&#x5341;&#x5E74;&#x5C31;&#x6709;&#x4E86;&#x3002; &#x6211;&#x4EEC;&#x4F1A;&#x7528;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#x6765;&#x601D;&#x8003;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x7EC4;&#x7EC7;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x7528; Swift &#x5199;&#x4E00;&#x6BB5;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x770B;&#x770B;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">var</span> persons: [<span class="hljs-type">Person</span>] = []
<span class="hljs-keyword">for</span> name <span class="hljs-keyword">in</span> names {
    <span class="hljs-keyword">let</span> person = <span class="hljs-type">Person</span>(name: name)
    <span class="hljs-keyword">if</span> person.isValid {
        persons.append(person)
    }
}
</code></pre>
<p>&#x8FD9;&#x662F;&#x4E2A;&#x5B9E;&#x73B0;&#x4E86;&#x4E24;&#x4EF6;&#x4E8B;&#x7684;&#x7B80;&#x5355;&#x5FAA;&#x73AF;&#xFF1A;&#x7528; name &#x5B9E;&#x4F8B; person&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6709;&#x6548;&#x7684; person &#x63D2;&#x5165;&#x5230;&#x6570;&#x7EC4;&#x5F53;&#x4E2D;&#x3002;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x662F;&#x505A;&#x4E86;&#x4E0D;&#x5C11;&#x5DE5;&#x4F5C;&#x3002;&#x56E0;&#x4E3A;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x5176;&#x4E2D;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x5FC5;&#x987B;&#x4ECE;&#x5934;&#x770B;&#x5230;&#x5C3E;&#x8FC7;&#x4E00;&#x904D;&#x3002;&#x800C;&#x4E14;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x601D;&#x8003;&#xFF0C;&#x201C;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#x662F;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;&#x201D;</p>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5176;&#x5B9E;&#x8FD8;&#x53EF;&#x4EE5;&#x66F4;&#x7B80;&#x5355;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5173;&#x6CE8;&#x70B9;&#x5206;&#x79BB;(separate the concerns)&#xFF0C;&#x628A;&#x4E8B;&#x60C5;&#x5206;&#x5F00;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x4E24;&#x4E2A;&#x5FAA;&#x73AF;&#xFF0C;&#x6BCF;&#x4E2A;&#x5FAA;&#x73AF;&#x505A;&#x5C11;&#x91CF;&#x7684;&#x4E8B;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x6BCF;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5FAA;&#x73AF;&#x4EE3;&#x7801;&#x91CC;&#x9762;&#x627E;&#x5230;&#x6A21;&#x5F0F;&#xFF1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x904D;&#x5386;&#x4E00;&#x4E9B;&#x503C;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x503C;&#x4E0A;&#x9762;&#x505A;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x6700;&#x540E;&#x628A;&#x5B83;&#x4EEC;&#x63D2;&#x5165;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x91CC;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x6709;&#x4E00;&#x4E9B;&#x4E8B;&#x9700;&#x8981;&#x91CD;&#x590D;&#x6267;&#x884C;&#x591A;&#x6B21;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7C7B;&#x4F3C;&#x4E00;&#x4E2A; extract &#x51FD;&#x6570; - Swift &#x5C31;&#x6709;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x53EB; &#x201C;map&#x201D;&#x3002;Map &#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x7684;&#x4E1C;&#x897F;&#x8F6C;&#x6362;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;Map &#x4F1A;&#x5305;&#x542B;&#x6240;&#x6709;&#x6709;&#x6548;&#x6216;&#x65E0;&#x6548;&#x7684; <code>person</code> &#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x662F;&#x4E2A;&#x57FA;&#x4E8E; names &#x7684; persons &#x5217;&#x8868;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x8FC7;&#x4E00;&#x904D;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8868;&#x8FBE;&#x7684;&#x5DF2;&#x7ECF;&#x5728;&#x8FD9;&#x91CC;&#x9762;&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> possiblePersons = names.<span class="hljs-built_in">map</span>(<span class="hljs-type">Person</span>.<span class="hljs-keyword">init</span>)
<span class="hljs-keyword">let</span> persons = possiblePersons.<span class="hljs-built_in">filter</span> { $<span class="hljs-number">0</span>.isValid }
</code></pre>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x6A21;&#x5F0F;&#x4E5F;&#x5F88;&#x5E38;&#x89C1;&#xFF1A;&#x53EB;&#x201C;filter&#x201D;&#x3002;Filter &#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x8FD4;&#x56DE; bool &#x7684;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x3002;Filter &#x9002;&#x7528;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6709;&#x6548;&#x7684; person&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06; map &#x548C; filter &#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x628A; map &#x5F97;&#x5230;&#x7684; Person &#x5217;&#x8868;&#x653E;&#x5230; filter &#x51FD;&#x6570;&#x5F53;&#x4E2D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x4E0A;&#x9762;&#x7684;7&#x884C;&#x4EE3;&#x7801;&#x51CF;&#x5C11;&#x5230;2&#x884C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91CD;&#x7EC4;&#x5B83;&#x4EEC;&#xFF1A;&#x628A;&#x8FD9;&#x4E9B;&#x6240;&#x6709;&#x51FD;&#x6570;&#x901A;&#x8FC7;&#x94FE;&#x5F0F;(chaining)&#x653E;&#x5728;&#x4E00;&#x8D77;&#x5904;&#x7406;&#x3002;</p>
<p>&#x5B83;&#x5341;&#x5206;&#x6613;&#x8BFB;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x6B21;&#x5C31;&#x53EF;&#x4EE5;&#x8BFB;&#x5B8C;&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> persons = names
    .<span class="hljs-built_in">map</span>(<span class="hljs-type">Person</span>.<span class="hljs-keyword">init</span>)
    .<span class="hljs-built_in">filter</span> { $<span class="hljs-number">0</span>.isValid }
</code></pre>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x503C;&#x5F97;&#x597D;&#x597D;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x9002;&#x5E94;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#xFF08;<em>&#x5728;&#x6211;&#x770B;&#x6765;&#x8FD9;&#x5F88;Swift</em>&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#x65E0;&#x9700;&#x518D;&#x5199; for &#x5FAA;&#x73AF;&#x3002;</p>
<h3 id="&#x51FD;&#x6570;&#x5F0F;&#x5DE5;&#x5177;">&#x51FD;&#x6570;&#x5F0F;&#x5DE5;&#x5177;</h3>
<p>&#x5728;1977&#x5E74;&#xFF0C;&#x7EA6;&#x7FF0;&#xB7;&#x5DF4;&#x79D1;&#x65AF;(John Backus)(&#x5E2E;&#x52A9;&#x53D1;&#x660E;&#x4E86; FORTRAN &#x548C; ALGOL)&#x8D62;&#x5F97;&#x4E86;&#x56FE;&#x7075;&#x5956;&#xFF0C;&#x5E76;&#x53D1;&#x8868;&#x4E86;&#x4E00;&#x573A;&#x540D;&#x53EB;<em>&#x201C;&#x7F16;&#x7A0B;&#x80FD;&#x5426;&#x4ECE; Von Neumann &#x98CE;&#x683C;&#x4E2D;&#x89E3;&#x653E;&#x51FA;&#x6765;&#x201D;</em>&#x7684;&#x6F14;&#x8BB2;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x6807;&#x9898;&#x3002;&#x201C;Von Neumann &#x98CE;&#x683C;&#x201D;&#x6307;&#x7684;&#x5C31;&#x662F; FORTRAN &#x548C; ALGOL&#x3002;</p>
<p>&#x8FD9;&#x6B21;&#x6F14;&#x8BB2;&#x662F;&#x4E00;&#x573A;&#x9053;&#x6B49;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x4ED6;&#x53D1;&#x660E;&#x4E86; FORTRAN &#x548C; ALGOL&#x3002;&#x4ED6;&#x89E3;&#x91CA;&#x8BF4;&#xFF0C;&#x6307;&#x4EE4;&#x5F0F;&#x7F16;&#x7A0B;&#x662F;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x6539;&#x53D8;&#x4E00;&#x4E9B;&#x72B6;&#x6001;&#xFF0C;&#x76F4;&#x5230;&#x8FDB;&#x5165;&#x4F60;&#x60F3;&#x5F97;&#x5230;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#x3002;&#x4ED6;&#x8BF4;&#x201C;&#x51FD;&#x6570;&#x201D;&#x8FD9;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x4ECA;&#x5929;&#x6240;&#x8BF4;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4ED6;&#x9F13;&#x52B1;&#x8BB8;&#x591A;&#x51FD;&#x6570;&#x7814;&#x7A76;&#x8005;&#x53BB;&#x5B66;&#x4E60;&#x7814;&#x7A76;&#x3002;</p>
<p>&#x6211;&#x5BF9;&#x8BE5;&#x6F14;&#x8BB2;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x5E26;&#x7ED9; Swift&#xFF1A;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5C06;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#x5206;&#x89E3;&#x6210;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F7F;&#x8FD9;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x53D8;&#x5F97;&#x901A;&#x7528;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#xFF08;&#x5982;&#x4EE3;&#x6570;&#xFF09;&#x5C06;&#x5B83;&#x4EEC;&#x7C98;&#x5408;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x4EE3;&#x6570;&#x7684;&#x89C4;&#x5219;&#x662F;&#x628A;&#x4E1C;&#x897F;&#x5806;&#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x6761;&#x4EF6;&#x5206;&#x79BB;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x8D77;&#x8F6C;&#x6362;&#x5B83;&#x4EEC;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x63A7;&#x5236;&#x7A0B;&#x5E8F;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x505A;&#x5230;&#x4E86;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x5206;&#x89E3;&#x6210;&#x4E24;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x627E;&#x5230;&#x5B83;&#x4EEC;&#x60EF;&#x7528;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x94FE;&#x5F0F;(chaining)&#x94FE;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5F53; Haskell &#x5F00;&#x53D1;&#x8005;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6; Swift &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x89C9;&#x5F97;&#x4E0D;&#x723D;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E00;&#x76F4;&#x5B9E;&#x8DF5;&#x7684;&#x662F; Haskell &#x7684;&#x7406;&#x8BBA;&#x3002;</p>
<p>&#x5C31;&#x5982;&#x6240;&#x6709;&#x51FD;&#x6570;&#x5F0F;&#x8BED;&#x8A00;&#x4E00;&#x6837;&#xFF0C;Haskell &#x7684;&#x57FA;&#x7840;&#x6784;&#x6210;&#x5355;&#x4F4D;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x3002;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x975E;&#x5E38;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x7EC4;&#x7EC7;&#x51FD;&#x6570;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x51FD;&#x6570;&#xFF0C;&#x53EB; <code>sum</code>&#xFF0C;&#x628A; <code>foldr</code> &#x51FD;&#x6570;&#x548C; <code>+</code> &#x51FD;&#x6570;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x8D4B;&#x4E88;&#x5176;&#x521D;&#x59CB;&#x503C;&#x4E3A; <code>0</code>&#x3002;&#x4F60;&#x9605;&#x8BFB;&#x65F6;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x4E0D;&#x987A;&#x7545;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x8FD0;&#x7528;&#x8D77;&#x6765;&#xFF0C;&#x5B83;&#x7684;&#x9B45;&#x529B;&#x4F1A;&#x628A;&#x4F60;&#x6298;&#x670D;&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> sum = foldr (+) <span class="hljs-number">0</span>
  sum [<span class="hljs-number">1</span>..<span class="hljs-number">10</span>]
</code></pre>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x5728; Swift &#x4E0A;&#xFF0C;&#x4F46;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x4E11;&#x964B;&#xFF0C;&#x53C8;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x8FD0;&#x884C;&#xFF0C;&#x522B;&#x7528;&#x9519;&#x4E86;&#x5355;&#x4F4D;&#x7EC4;&#x5408;&#xFF0C;Swift &#x53EF;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#x5F0F;&#x3002;</p>
<p>Swift &#x7684;&#x6784;&#x6210;&#x5355;&#x4F4D;&#x662F;&#x7C7B;&#x578B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528; Classes&#xFF0C;structs&#xFF0C;enums &#x548C; protocols &#x6765;&#x6784;&#x5EFA;(compose)&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5C06;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F7F;&#x7528;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x6784;&#x5EFA;&#x5B83;&#x4EEC;&#x3002;</p>
<p>Swift &#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x6784;&#x6210;&#x662F;&#x5C06;&#x7C7B;&#x578B;&#x6DFB;&#x52A0;&#x4E0A;&#x4E0B;&#x6587;(context)&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x53EF;&#x9009;(optionals)&#x7C7B;&#x578B;&#x3002;&#x53EF;&#x9009;(optional)&#x662F;&#x6DFB;&#x52A0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x53EF;&#x80FD;&#x6709;&#x503C;&#xFF0C;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x3002;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x5C31;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x4FE1;&#x606F;&#xFF1A;&#x5B83;&#x662F;&#x5426;&#x5B58;&#x5728;&#xFF1F;&#x8FD9;&#x5C31;&#x662F;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x610F;&#x601D;&#x3002;&#x6DFB;&#x52A0;&#x4E0A;&#x4E0B;&#x6587;&#x6BD4;&#x5176;&#x4ED6;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#x66F4;&#x5F3A;&#x5927;&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-class"><span class="hljs-keyword">extension</span> <span class="hljs-title">MyStruct</span>&lt;<span class="hljs-title">T</span>&gt;: <span class="hljs-title">Sequence</span> </span>{
    <span class="hljs-function"><span class="hljs-keyword">func</span> <span class="hljs-title">makeIterator</span><span class="hljs-params">()</span></span> -&gt; <span class="hljs-type">AnyIterator</span>&lt;<span class="hljs-type">T</span>&gt; {
<span class="hljs-keyword">return</span> ... }
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8DDF;&#x8E2A;&#x67E5;&#x770B;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5224;&#x65AD;&#x5B83;&#x662F;&#x4E0D;&#x662F;&#x6574;&#x6570;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x503C;&#xFF0C;&#x662F;&#x5426;&#x4E3A;<code>-1</code>&#xFF0C;&#x5982;&#x679C;&#x662F;<code>-1</code>&#x90A3;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x662F;&#x65E0;&#x6548;&#x503C;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x5730;&#x65B9;&#x90FD;&#x5199;&#x4E0A;&#x8FD9;&#x6837;&#x7684;&#x5224;&#x65AD;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4EE3;&#x7801;&#x5F00;&#x59CB;&#x53D8;&#x5F97;&#x4E11;&#x964B;&#x8D77;&#x6765;&#xFF0C;&#x800C;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x751A;&#x81F3;&#x7F16;&#x8BD1;&#x5668;&#x4E5F;&#x5E2E;&#x4E0D;&#x5230;&#x4F60;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A; int &#x52A0;&#x4E0A;&#x53EF;&#x9009;&#x7C7B;&#x578B;&#xFF0C;&#x90A3;&#x4E48;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#xFF0C;&#x8FD9;&#x4E2A; int &#x5C31;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF1A;&#x201C;&#x6709;&#x503C;&#xFF0C;&#x6CA1;&#x503C;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x4F60;&#x4E0D;&#x4F1A;&#x5FD8;&#x8BB0;&#x5B83;&#x201D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x66FE;&#x7ECF;&#x4F7F;&#x7528;&#x8FC7;<code>-1</code>&#xFF0C;&#x800C;&#x8FD9;&#x53C8;&#x5F88;&#x5BB9;&#x6613;&#x5FD8;&#x8BB0;&#x68C0;&#x67E5;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x8D70;&#x5230;&#x4F60;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-comment">// No value: magic value</span>
<span class="hljs-keyword">let</span> noValue = -<span class="hljs-number">1</span>
<span class="hljs-keyword">let</span> n = <span class="hljs-number">0</span>
<span class="hljs-keyword">if</span> n != noValue { ... }

<span class="hljs-comment">// No value: context</span>
<span class="hljs-keyword">let</span> n: <span class="hljs-type">Int</span>? = <span class="hljs-number">0</span>
<span class="hljs-keyword">if</span> <span class="hljs-keyword">let</span> n = n { ... }
</code></pre>
<h3 id="&#x4F8B;&#x5B50;">&#x4F8B;&#x5B50;</h3>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-function"><span class="hljs-keyword">func</span> <span class="hljs-title">login</span><span class="hljs-params">(username: String, password: String,
           completion: <span class="hljs-params">(String?, Error?)</span></span></span> -&gt; <span class="hljs-type">Void</span>)
login(username: <span class="hljs-string">&quot;rob&quot;</span>, password: <span class="hljs-string">&quot;s3cret&quot;</span>) {
    (token, error) <span class="hljs-keyword">in</span>
    <span class="hljs-keyword">if</span> <span class="hljs-keyword">let</span> token = token {
        <span class="hljs-comment">// success</span>
    } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> <span class="hljs-keyword">let</span> error = error {
<span class="hljs-comment">// failure }</span>
}
</code></pre>
<p>&#x8FD9;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684; API&#x3002;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;<code>&#x767B;&#x5F55;</code>&#x51FD;&#x6570;&#xFF0C;&#x9700;&#x8981;<code>&#x7528;&#x6237;&#x540D;</code>&#x548C;<code>&#x5BC6;&#x7801;</code>&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x4F1A;&#x56DE;&#x4F20;&#x4E00;&#x4E2A; <code>token</code> &#x548C;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x4E0A;&#x4E0B;&#x6587;(content)&#x5904;&#x7406;&#x7684;&#x66F4;&#x597D;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;</strong>&#x662F; <code>completion</code> &#x56DE;&#x8C03;&#x3002;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x662F;&#x4E00;&#x4E2A; String&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;&#x4E00;&#x4E2A; token&#x3002;&#x6211;&#x53EF;&#x4EE5;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A; label&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x6CA1;&#x6709;&#x7528;&#x3002;&#x5728; Swift &#x4E2D;&#xFF0C;label &#x4E0D;&#x662F;&#x7C7B;&#x578B;&#x3002;&#x5373;&#x65F6;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#xFF0C;&#x5B83;&#x4F9D;&#x65E7;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x3002;</p>
<p>Token &#x6709;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#xFF1A;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x80FD;&#x4E3A;&#x7A7A;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x8868;&#x793A;&#xFF0C;&#x4F46;&#x90FD;&#x4E0D;&#x80FD;&#x8868;&#x793A; token&#x3002;&#x6211;&#x4EEC;&#x60F3;&#x8981; <code>token</code> &#x5E26;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x5B83;&#x662F;&#x6709;&#x89C4;&#x5219;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x3002;&#x65E2;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED9;&#x5B83;&#x66F4;&#x591A;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x79F0;&#x5B83;&#x4E3A; <code>struct</code>&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">Token</span> </span>{
    <span class="hljs-keyword">let</span> string: <span class="hljs-type">String</span>
}
</code></pre>
<p>&#x6211;&#x628A;&#x5B57;&#x7B26;&#x4E32;&#x52A0;&#x5165;&#x5230;&#x7ED3;&#x6784;&#x5F53;&#x4E2D;&#x3002;&#x8FD9;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x5176;&#x4ED6;&#x5F00;&#x9500;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x989D;&#x5916;&#x5185;&#x5B58;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x6211;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#x8FD0;&#x7528;&#x5728;&#x8FD9;&#x91CC;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x5C31;&#x53EA;&#x80FD;&#x6784;&#x5EFA;&#x4E00;&#x4E9B;&#x6307;&#x5B9A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4F7F;&#x7528;&#x6269;&#x5C55;&#x8FD8;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x66F4;&#x68D2;&#x7684;&#x662F;&#x8FD9;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x6240;&#x6709;&#x7C7B;&#x578B;&#xFF0C;string&#xFF0C;dictionary&#xFF0C;array&#xFF0C;int &#x7B49;&#xFF0C;&#x7EDF;&#x7EDF;&#x6CA1;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F53;&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x4EEC;&#x6DFB;&#x52A0;&#x5230;&#x4E00;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x5F53;&#x4E2D;&#xFF0C;&#x5E76;&#x5728;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x5730;&#x65B9;&#x63A7;&#x5236;&#x5B83;&#x4EEC;&#x3002;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x5B83;&#x4EEC;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x3002;&#x6211;&#x4E0D;&#x518D;&#x9700;&#x8981; label &#x6216;&#x6DFB;&#x52A0;&#x6807;&#x6CE8;(comment)&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x7B2C;&#x4E00;&#x773C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x662F; Token &#x7C7B;&#x578B;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5C31;&#x662F;<code>&#x4EE4;&#x724C;(token)</code>&#x3002;</p>
<p><strong>&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;</strong>&#x662F;&#x6211;&#x4EEC;&#x4F20;&#x5165;&#x4E86;&#x4E00;&#x4E2A;<code>&#x7528;&#x6237;&#x540D;</code>&#x548C;<code>&#x5BC6;&#x7801;</code>&#x3002;&#x5728;&#x5927;&#x90E8;&#x5206;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x4F60;&#x603B;&#x4F1A;&#x628A;&#x5B83;&#x4EEC;&#x4E00;&#x8D77;&#x4F20;&#x5165;&#x8FDB;&#x53BB;&#xFF1B;&#x4F46;&#x5BC6;&#x7801;&#x672C;&#x8EAB;&#x5C31;&#x5F88;&#x5C11;&#x88AB;&#x4F7F;&#x7528;&#x5230;&#x3002;&#x6211;&#x60F3;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#xFF0C;&#x5141;&#x8BB8;&#x6211;&#x7528;&#x201C;and&#x201D;&#x628A;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x201C;and&#x201D;&#x7C7B;&#x578B;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x521A;&#x624D;&#x7528;&#x5230;&#x7684; struct&#x3002;</p>
<h3 id="and&#x7C7B;&#x578B;&#x79EF;">&#x201C;AND&#x201D;&#x7C7B;&#x578B;(&#x79EF;)</h3>
<pre><code class="lang-swift"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">Credential</span> </span>{
  <span class="hljs-keyword">var</span> username: <span class="hljs-type">String</span>
  <span class="hljs-keyword">var</span> password: <span class="hljs-type">String</span>
}
</code></pre>
<p>Struct &#x662F;&#x201C;and&#x201D;&#x7C7B;&#x578B;&#x3002;<code>Credential</code> &#x662F;&#x4E00;&#x4E2A;<code>&#x7528;&#x6237;&#x540D;</code>&#x548C;<code>&#x5BC6;&#x7801;</code>&#x3002;&#x201C;and&#x201D;&#x7C7B;&#x578B;&#x5E38;&#x7528;&#x7684;&#x540D;&#x5B57;&#x53EB;&#x201C;&#x79EF;&#x7C7B;&#x578B;&#x201D;(product type)&#x3002;</p>
<p>&#x6211;&#x9F13;&#x52B1;&#x4F60;&#x5927;&#x58F0;&#x7684;&#x628A;&#x770B;&#x6CD5;&#x8BF4;&#x51FA;&#x6765;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x201C;credential &#x7ED3;&#x6784;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x3002;&#x201D;&#x662F;&#x5426;&#x6709;&#x610F;&#x4E49;&#xFF1F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x662F;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x53C8;&#x6216;&#x8BB8;&#x662F;&#x4F60;&#x6784;&#x5EFA;&#x9519;&#x4E86;&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-function"><span class="hljs-keyword">func</span> <span class="hljs-title">login</span><span class="hljs-params">(credential: Credential,
           completion: <span class="hljs-params">(Token?, Error?)</span></span></span> -&gt; <span class="hljs-type">Void</span>)


<span class="hljs-keyword">let</span> credential = <span class="hljs-type">Credential</span>(username: <span class="hljs-string">&quot;rob&quot;</span>,
                            password: <span class="hljs-string">&quot;s3cret&quot;</span>)
login(credential: credential) { (token, error) <span class="hljs-keyword">in</span>
    <span class="hljs-keyword">if</span> <span class="hljs-keyword">let</span> token = token {
        <span class="hljs-comment">// success</span>
    } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> <span class="hljs-keyword">let</span> error = error {
        <span class="hljs-comment">// failure</span>
    }
}
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;<code>&#x7528;&#x6237;&#x540D;</code>&#x548C;<code>&#x5BC6;&#x7801;</code>&#x6362;&#x6210; <code>Credential</code>&#xFF1A;&#x8FD9;&#x4E5F;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x9A8C;&#x8BC1;&#x51FD;&#x6570;&#x53D8;&#x5F97;&#x66F4;&#x77ED;&#xFF0C;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x8FD8;&#x5F00;&#x8F9F;&#x4E86;&#x66F4;&#x591A;&#x4E0D;&#x9519;&#x7684;&#x53EF;&#x80FD;&#xFF1A;&#x5BF9; Credential &#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x6765;&#x4EE3;&#x66FF;&#x5B83;&#x4EEC;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x4E00;&#x4E2A; one0time &#x5BC6;&#x7801;&#xFF0C;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x4EE4;&#x724C;(access tokens)&#xFF0C;&#x6216;&#x8005; Facebook&#x3001;Google &#x7B49;&#x7B2C;&#x4E09;&#x65B9;&#x767B;&#x5F55;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4E0D;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x53EA;&#x9700;&#x4F20;&#x4E00;&#x4E2A;&#x51ED;&#x8BC1;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x4F9D;&#x65E7;&#x6709;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4F20;&#x9012;&#x4E86;&#x8FD9;&#x4E2A; <code>(Token?, Error?)</code> &#x5143;&#x7EC4;(tuple) - &#x5143;&#x7EC4;&#x662F;&#x201C;and&#x201D;&#x7C7B;&#x578B;&#x3002;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x533F;&#x540D;&#x6784;&#x9020;&#x4F53;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x610F;&#x601D;&#x662F;&#x201C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A; token&#xFF1F;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A; error&#x201D;&#x5417;&#xFF1F;&#x6240;&#x4EE5;&#x6709;&#x56DB;&#x79CD;&#x53EF;&#x80FD;&#xFF1A;&#x90FD;&#x662F;&#xFF0C;&#x90FD;&#x4E0D;&#x662F;&#xFF0C;&#x8981;&#x4E48;&#x662F; token&#xFF0C;&#x8981;&#x4E48;&#x662F; error&#x3002;&#x4F46;&#x4EFB;&#x4F55;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x53EA;&#x6709;&#x5176;&#x4E2D;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x5982;&#x679C;&#x6211;&#x540C;&#x65F6;&#x5F97;&#x5230;&#x4E00;&#x4E2A; token &#x548C; error&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x8FD9;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x60C5;&#x51B5;&#x5417;&#xFF1F;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x81F4;&#x547D;&#x7684;&#x9519;&#x8BEF;&#x7801;&#xFF1F;&#x9700;&#x8981;&#x5FFD;&#x7565;&#x5B83;&#x5417;&#xFF1F;&#x6B64;&#x65F6;&#x4F60;&#x9700;&#x8981;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x624D;&#x80FD;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x6D4B;&#x8BD5;&#x3002;</p>
<h3 id="or&#x7C7B;&#x578B;&#x548C;">&#x201C;OR&#x201D;&#x7C7B;&#x578B;(&#x548C;)</h3>
<p>&#x95EE;&#x9898;&#x662F;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x90FD;&#x8868;&#x793A;&#x51FA;&#x6765; - &#x4F60;&#x53EA;&#x9700;&#x8868;&#x8FBE;&#x6E05;&#x695A;&#x8FD9;&#x662F; token <strong>&#x6216;&#x662F;</strong> error&#x3002;&#x90A3;&#x4E48;&#x662F;&#x5426;&#x6709;&#x4E00;&#x4E2A;&#x201C;or&#x201D;&#x7C7B;&#x578B;&#x63D0;&#x4F9B;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5417;&#xFF1F;</p>
<pre><code class="lang-swift"><span class="hljs-class"><span class="hljs-keyword">enum</span> <span class="hljs-title">Result</span>&lt;<span class="hljs-title">Value</span>&gt; </span>{
    <span class="hljs-keyword">case</span> success(<span class="hljs-type">Value</span>)
    <span class="hljs-keyword">case</span> failure(<span class="hljs-type">Error</span>)
}
</code></pre>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x679A;&#x4E3E;(enum) - &#x679A;&#x4E3E;&#x662F;&#x201C;or&#x201D;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x7ED3;&#x6784;(struct)&#x662F;&#x201C;and&#x201D;&#x7C7B;&#x578B;&#x3002;&#x201C;and&#x201D;&#x7C7B;&#x578B;&#x662F;&#x201C;&#x79EF;&#x7C7B;&#x578B;&#x201D;(product type)&#xFF0C;&#x800C;&#x201C;or&#x201D;&#x662F;&#x201C;&#x548C;&#x7C7B;&#x578B;&#x201D;(sum type)&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-function"><span class="hljs-keyword">func</span> <span class="hljs-title">login</span><span class="hljs-params">(credential: Credential,
           completion: <span class="hljs-params">(Result&lt;Token&gt;)</span></span></span> -&gt; <span class="hljs-type">Void</span>)
login(credential: credential) { result <span class="hljs-keyword">in</span>
    <span class="hljs-keyword">switch</span> result {
    <span class="hljs-keyword">case</span> .success(<span class="hljs-keyword">let</span> token): <span class="hljs-comment">// success</span>
    <span class="hljs-keyword">case</span> .failure(<span class="hljs-keyword">let</span> error): <span class="hljs-comment">// failure</span>
    }
}
</code></pre>
<p>&#x6211;&#x6784;&#x5EFA;&#x4E00;&#x4E2A; <code>result</code> &#x7C7B;&#x578B;&#x3002;<em>result &#x7C7B;&#x578B;&#x4E0D;&#x662F;&#x5185;&#x5EFA;&#x5728; Swift &#x91CC;</em>&#xFF0C;&#x8FD9;&#x771F;&#x7684;&#x8BA9;&#x6211;&#x5F88;&#x607C;&#x706B;&#x3002;&#x5E78;&#x597D;&#x5B83;&#x5F88;&#x5BB9;&#x6613;&#x6784;&#x5EFA;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8D4B;&#x4E88; value &#x66F4;&#x591A;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x666E;&#x901A; value &#x53D8;&#x6210;&#x6709;&#x201C;&#x767B;&#x5F55;&#x6210;&#x529F;&#x201D;&#x542B;&#x4E49;&#x7684; value&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x7684; error &#x4E5F;&#x6709;&#x4E86;&#x66F4;&#x591A;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5B83;&#x66F4;&#x50CF;&#x5904;&#x7406;&#x5931;&#x8D25;&#x60C5;&#x51B5;&#x7684; error&#x3002;&#x5982;&#x679C;&#x8FD4;&#x56DE;&#x50CF;&#x4E4B;&#x524D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x7EC8; token &#x4F1A;&#x5305;&#x542B;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x6240;&#x6709;&#x4E0D;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#x90FD;&#x9700;&#x8981;&#x7F16;&#x5199;&#x4E00;&#x6B21;&#x6D4B;&#x8BD5;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x5DF2;&#x7ECF;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E86;&#x3002;&#x6211;&#x53EF;&#x4E0D;&#x60F3;&#x4E3A;&#x4E0D;&#x5B58;&#x5728;&#x7684; bug &#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x4E2A;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;API&#x3002;&#x6211;&#x901A;&#x7528;&#x4E00;&#x4E2A; credential&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6700;&#x7EC8;&#x7684; token&#x3002;</p>
<h3 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h3>
<p>&#x8FD9;&#x662F;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x771F;&#x6B63;&#x7684;&#x9057;&#x4EA7;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E5F;&#x5E94;&#x8BE5;&#x5E26;&#x7ED9; Swift&#xFF1A;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x6210;&#x66F4;&#x5C0F;&#xFF0C;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x8FD9;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x627E;&#x5230;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF0C;&#x5E76;&#x5728;&#x7A0B;&#x5E8F;&#x6709;&#x6761;&#x7406;&#x7684;&#x4F7F;&#x7528;&#x4E00;&#x8D2F;&#x7684;&#x89C4;&#x5219;&#x5C06;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x8FD9;&#x80FD;&#x907F;&#x514D;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x4F1A;&#x51FA;&#x9519;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x8BA4;&#x4E3A;&#x5728;70&#x5E74;&#x4EE3;&#x7684;&#x7EA6;&#x7FF0;&#xB7;&#x5DF4;&#x79D1;&#x65AF;(John Backus)&#x4E5F;&#x4F1A;&#x8BA4;&#x540C;&#x8FD9;&#x4E2A;&#x89C2;&#x70B9;&#x3002;&#x6253;&#x7834;&#x5B83;&#xFF0C;&#x5E76;&#x91CD;&#x5EFA;(Break it down, build it up)&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../swift.html" class="navigation navigation-prev " aria-label="Previous page: Swift">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="swift-gallagher-value-semantics.html" class="navigation navigation-next " aria-label="Next page: 值语义(不是值类型)">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Swift 和函数式编程的遗产","level":"1.3.1","depth":2,"next":{"title":"值语义(不是值类型)","level":"1.3.2","depth":2,"path":"swift/swift-gallagher-value-semantics.md","ref":"swift/swift-gallagher-value-semantics.md","articles":[]},"previous":{"title":"Swift","level":"1.3","depth":1,"path":"swift.md","ref":"swift.md","articles":[{"title":"Swift 和函数式编程的遗产","level":"1.3.1","depth":2,"path":"swift/tryswift-rob-napier-swift-legacy-functional-programming.md","ref":"swift/tryswift-rob-napier-swift-legacy-functional-programming.md","articles":[]},{"title":"值语义(不是值类型)","level":"1.3.2","depth":2,"path":"swift/swift-gallagher-value-semantics.md","ref":"swift/swift-gallagher-value-semantics.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-sharing"],"styles":{"website":"styles/website.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Alex Tse","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"iOS 教程, iOS Tutorial","links":{"sidebar":{"Alex Tse":"http://xiemin.me"}},"gitbook":"*","description":"iOS 教程, iOS Tutorial"},"file":{"path":"swift/tryswift-rob-napier-swift-legacy-functional-programming.md","mtime":"2017-08-11T09:20:51.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2017-08-11T09:27:35.776Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

