
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>这界面是我的还是你的？ · iOS 教程, iOS Tutorial</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Alex Tse">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../design.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://github.com/ixiemin/iOS-Tutorial" target="_blank" class="custom-link">Alex Tse</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../animation.html">
            
                <a href="../animation.html">
            
                    
                    Animation
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../animation/implement-circular-image-loader-animation-cashapelayer.html">
            
                <a href="../animation/implement-circular-image-loader-animation-cashapelayer.html">
            
                    
                    如何使用 CAShapeLayer 实现圆形图像加载动画
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../function.html">
            
                <a href="../function.html">
            
                    
                    Function
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../function/real-time-communication-with-streams-tutorial-for-ios.html">
            
                <a href="../function/real-time-communication-with-streams-tutorial-for-ios.html">
            
                    
                    iOS 实时流通讯
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../function/ios-11-password-autofill.html">
            
                <a href="../function/ios-11-password-autofill.html">
            
                    
                    iOS 11 自动填充密码
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../map.html">
            
                <a href="../map.html">
            
                    
                    Map
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../map/make-app-like-runkeeper-part-1-2.html">
            
                <a href="../map/make-app-like-runkeeper-part-1-2.html">
            
                    
                    如何开发一个类似 Runkeeper 的 App 1/2
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../map/make-app-like-runkeeper-part-2-2.html">
            
                <a href="../map/make-app-like-runkeeper-part-2-2.html">
            
                    
                    如何开发一个类似 Runkeeper 的 App 2/2
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../swift.html">
            
                <a href="../swift.html">
            
                    
                    Swift
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../swift/tryswift-rob-napier-swift-legacy-functional-programming.html">
            
                <a href="../swift/tryswift-rob-napier-swift-legacy-functional-programming.html">
            
                    
                    Swift 和函数式编程的遗产
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../swift/swift-gallagher-value-semantics.html">
            
                <a href="../swift/swift-gallagher-value-semantics.html">
            
                    
                    值语义(不是值类型)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../swift/swift-algorithm-club-booyer-moore-string-search-algorithm.html">
            
                <a href="../swift/swift-algorithm-club-booyer-moore-string-search-algorithm.html">
            
                    
                    Swift 算法俱乐部：Boyer Moore 字符串搜索算法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../design.html">
            
                <a href="../design.html">
            
                    
                    Design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.6.1" data-path="is-this-my-interface-or-yours.html">
            
                <a href="is-this-my-interface-or-yours.html">
            
                    
                    这界面是我的还是你的？
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >这界面是我的还是你的？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8FD9;&#x754C;&#x9762;&#x662F;&#x6211;&#x7684;&#x8FD8;&#x662F;&#x4F60;&#x7684;&#xFF1F;">&#x8FD9;&#x754C;&#x9762;&#x662F;&#x6211;&#x7684;&#x8FD8;&#x662F;&#x4F60;&#x7684;&#xFF1F;</h1>
<p><a href="https://medium.com/@jsaito/is-this-my-interface-or-yours-b09a7a795256" target="_blank">&#x539F;&#x6587;&#x5730;&#x5740;</a> / &#x4F5C;&#x8005;&#xFF1A;John Saito</p>
<p>&#x7FFB;&#x8BD1;&#x4E8E;&#xFF1A;2017/09/18&#xFF0C;Alex Tse</p>
<hr>
<p><img src="../assets/design/is-this-my-interface-or-yours/1.png" alt=""></p>
<h2 id="&#x300C;&#x6211;&#x7684;&#x7535;&#x8111;&#x300D;&#x7684;&#x6F14;&#x53D8;">&#x300C;&#x6211;&#x7684;&#x7535;&#x8111;&#x300D;&#x7684;&#x6F14;&#x53D8;</h2>
<p>&#x90FD;&#x8FD8;&#x8BB0;&#x5F97;&#x4EE5;&#x524D; Windows &#x90A3;&#x4E2A;&#x300C;&#x6211;&#x7684;&#x7535;&#x8111;&#x300D;&#x7684;&#x56FE;&#x6807;&#x5417;&#xFF1F;&#x8FD9;&#x662F;&#x4E2A;&#x5149;&#x8363;&#x7684;&#x5C0F;&#x56FE;&#x6807;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x4E86;&#x4F60;&#x7535;&#x8111;&#x4E0A;&#x6240;&#x6709;&#x4E1C;&#x897F; - &#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F60;&#x7684;&#x6570;&#x5B57;&#x4F5C;&#x54C1;&#x7B49;&#x3002;</p>
<p>&#x5728; Windows &#x540E;&#x9762;&#x7684;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x5FAE;&#x8F6F;&#x628A;&#x56FE;&#x6807;&#x7684;&#x540D;&#x5B57;&#x6539;&#x4E3A;&#x300C;&#x8BA1;&#x7B97;&#x673A;&#x300D;&#xFF0C;&#x540E;&#x6765;&#x53C8;&#x6539;&#x4E3A;&#x300C;&#x6B64;&#x7535;&#x8111;&#x300D;(This PC)&#x3002;&#x4ED6;&#x4EEC;&#x628A;&#x540D;&#x5B57;&#x6539;&#x4E86;&#xFF0C;&#x96BE;&#x9053;&#x662F;&#x56E0;&#x4E3A;&#x300C;&#x6211;&#x7684;&#x300D;&#x5177;&#x6709;&#x8BEF;&#x5BFC;&#x6027;&#xFF1F;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#xFF1F;&#x8FD8;&#x662F;&#x8BF4;&#x8FD9;&#x662F;&#x591A;&#x4F59;&#x7684;&#x5462;&#xFF1F;</p>
<p><img src="../assets/design/is-this-my-interface-or-yours/2.png" alt=""></p>
<h2 id="&#x5C5E;&#x4E8E;&#x4F60;&#x7684;&#x4E1C;&#x897F;&#x8981;&#x600E;&#x4E48;&#x79F0;&#x547C;&#xFF1F;">&#x5C5E;&#x4E8E;&#x4F60;&#x7684;&#x4E1C;&#x897F;&#x8981;&#x600E;&#x4E48;&#x79F0;&#x547C;&#xFF1F;</h2>
<p>&#x89C2;&#x5BDF;&#x4E0B;&#x4F60;&#x4F7F;&#x7528;&#x7684; App&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x7528;&#x4E8E;&#x8868;&#x793A;<em>&#x4F60;&#x7684;&#x4E1C;&#x897F;</em>&#x7684;&#x754C;&#x9762;&#x662F;&#x6CA1;&#x6709;&#x6807;&#x51C6;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x53C2;&#x8003;&#x7684;&#x3002;&#x6709;&#x7684;&#x8BF4;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x8BF4;&#x8FD9;&#x662F;&#x4F60;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p><img src="../assets/design/is-this-my-interface-or-yours/3.png" style="width:90%"></p>
<p>&#x5047;&#x5982;&#x4F60;&#x6B63;&#x5728;&#x8BBE;&#x8BA1;&#x754C;&#x9762;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BCD;&#x662F;&#x5E94;&#x8BE5;&#x4ECE;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x8FD8;&#x662F;&#x4ECE;&#x4EA7;&#x54C1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x51B3;&#x5B9A;&#xFF1F;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5FAE;&#x5999;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x5728;&#x4F7F;&#x7528;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#x65F6;&#x7684;&#x611F;&#x89C9;&#x5982;&#x4F55;&#x3002;</p>
<h2 id="&#x4ECE;&#x300C;&#x6211;&#x7684;&#x300D;&#x89D2;&#x5EA6;&#x8003;&#x8651;">&#x4ECE;&#x300C;&#x6211;&#x7684;&#x300D;&#x89D2;&#x5EA6;&#x8003;&#x8651;</h2>
<p>&#x5728;&#x754C;&#x9762;&#x4E0A;&#x4F7F;&#x7528;&#x300C;&#x6211;&#x7684;&#x300D;&#x610F;&#x5473;&#x7740;&#x4EA7;&#x54C1;&#x662F;&#x7528;&#x6237;&#x7684;&#x5EF6;&#x4F38;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4EA7;&#x54C1;&#x4EE3;&#x8868;&#x7740;&#x7528;&#x6237;&#x6807;&#x8BB0;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x300C;&#x6211;&#x7684;&#x300D;&#x611F;&#x89C9;&#x662F;&#x4E2A;&#x4EBA;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5C31;&#x50CF;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x53BB;&#x5B9A;&#x4E49;&#x5B83;&#x548C;&#x63A7;&#x5236;&#x5B83;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x5F3A;&#x8C03;&#x9690;&#x79C1;&#xFF0C;&#x4E2A;&#x6027;&#x5316;&#xFF0C;&#x6240;&#x6709;&#x6743;&#x65F6;&#xFF0C;&#x300C;&#x6211;&#x7684;&#x300D;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x9002;&#x5408;&#x3002;&#x8FD9;&#x6216;&#x8BB8;&#x5C31;&#x662F;&#x51E0;&#x5E74;&#x524D;&#x4F7F;&#x7528;&#x300C;&#x6211;&#x7684;&#x7535;&#x8111;&#x300D;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x65F6;&#x7535;&#x8111;&#x51E0;&#x4E4E;&#x662F;&#x5355;&#x673A;&#x4F53;&#x9A8C;&#xFF0C;&#x7528;&#x6237;&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x5171;&#x4EAB;&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x5728;&#x90A3;&#x4E2A;&#x5C0F;&#x56FE;&#x6807;&#x91CC;&#x9762;&#x5B89;&#x5168;&#x7684;&#x5F85;&#x7740;&#x3002;</p>
<p><img src="../assets/design/is-this-my-interface-or-yours/4.png" alt=""></p>
<h2 id="&#x4ECE;&#x300C;&#x4F60;&#x7684;&#x300D;&#x89D2;&#x5EA6;&#x8003;&#x8651;">&#x4ECE;&#x300C;&#x4F60;&#x7684;&#x300D;&#x89D2;&#x5EA6;&#x8003;&#x8651;</h2>
<p>&#x5728;&#x754C;&#x9762;&#x4E0A;&#x4F7F;&#x7528;&#x300C;&#x4F60;&#x7684;&#x300D;&#x610F;&#x5473;&#x7740;&#x4EA7;&#x54C1;&#x6B63;&#x5728;&#x548C;&#x4F60;&#x8BF4;&#x8BDD;&#xFF0C;&#x4EA7;&#x54C1;&#x5C31;&#x50CF;&#x662F;&#x4F60;&#x7684;&#x4E2A;&#x4EBA;&#x52A9;&#x7406;&#xFF0C;&#x5E2E;&#x52A9;&#x4F60;&#x5B8C;&#x6210;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;&#x300E;&#x8FD9;&#x91CC;&#x662F;&#x4F60;&#x7684;&#x97F3;&#x4E50;&#x3002;&#x8FD9;&#x91CC;&#x662F;&#x4F60;&#x7684;&#x8BA2;&#x5355;&#x3002;&#x300F;</p>
<p>&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#xFF0C;&#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x5728;&#x5BF9;&#x8BDD;&#xFF0C;&#x50CF;&#x662F;&#x5728;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x5B8C;&#x6210;&#x67D0;&#x9879;&#x4EFB;&#x52A1;&#xFF0C;&#x4F7F;&#x7528;&#x300C;&#x4F60;&#x7684;&#x300D;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x5408;&#x9002;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x652F;&#x4ED8;&#x8D26;&#x5355;&#xFF0C;&#x9884;&#x7EA6;&#xFF0C;&#x586B;&#x5199;&#x7A0E;&#x5355;&#xFF0C;&#x80FD;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x66F4;&#x5FEB;&#xFF0C;&#x66F4;&#x667A;&#x80FD;&#xFF0C;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5B8C;&#x6210;&#x67D0;&#x9879;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5982;&#x4ECA;&#x7684;&#x7535;&#x8111;&#x548C; App &#x51E0;&#x4E4E;&#x662F;&#x626E;&#x6F14;&#x7740;&#x4E00;&#x4E2A;&#x79C1;&#x4EBA;&#x52A9;&#x7406;&#x7684;&#x89D2;&#x8272;&#x3002;&#x50CF; Siri&#xFF0C;Alexa &#x548C; Cortana&#xFF0C;&#x5979;&#x4EEC;&#x5E2E;&#x4F60;&#x505A;&#x7B14;&#x8BB0;&#xFF0C;&#x63D0;&#x9192;&#x4F60;&#x4E70;&#x725B;&#x5976;&#xFF0C;&#x5927;&#x58F0;&#x7684;&#x5E2E;&#x4F60;&#x8BFB;&#x90AE;&#x4EF6;&#x3002;</p>
<p><img src="../assets/design/is-this-my-interface-or-yours/5.png" style="width:90%"></p>
<p>&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684; App&#xFF0C;&#x5305;&#x62EC; Medium&#xFF0C;&#x90FD;&#x4F1A;&#x7ED9;&#x4F60;&#x63A8;&#x8350;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x63A8;&#x8350;&#x6545;&#x4E8B;&#x7ED9;&#x6211;&#x9605;&#x8BFB;&#x7684;&#x79C1;&#x4EBA;&#x52A9;&#x624B;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x79CD;&#x8D8B;&#x52BF;&#x4EE5;&#x540E;&#x4F1A;&#x66F4;&#x52A0;&#x7684;&#x666E;&#x904D;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684; App &#x4F7F;&#x7528;&#x7684;&#x662F;&#x300C;&#x4F60;&#x7684;&#x300D;&#x800C;&#x4E0D;&#x662F;&#x300C;&#x6211;&#x7684;&#x300D;&#x3002;</p>
<h2 id="&#x8003;&#x8651;&#x5220;&#x53BB;">&#x8003;&#x8651;&#x5220;&#x53BB;</h2>
<p>&#x548C;&#x8BBE;&#x8BA1;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x7684;&#x4E8B;&#x60C5;&#x4E00;&#x6837;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x53EF;&#x4EE5;&#x7B26;&#x5408;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x7684;&#x3002;&#x4F46;&#x73B0;&#x5728;&#x6709;&#x5F88;&#x591A;&#x4EA7;&#x54C1;&#x53EA;&#x8981;&#x662F;&#x5C5E;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x4F1A;&#x628A;&#x300C;&#x6211;&#x7684;&#x300D;&#x6216;&#x8005;&#x300C;&#x4F60;&#x7684;&#x300D;&#x8FD9;&#x7C7B;&#x8BCD;&#x5220;&#x6389;&#x3002;</p>
<p><img src="../assets/design/is-this-my-interface-or-yours/6.png" style="width:90%"></p>
<p>&#x8FD9;&#x79CD;&#x53BB;&#x6389;&#x300C;&#x6211;&#x7684;&#x300D;&#x7684;&#x65B9;&#x5F0F;&#x6216;&#x8BB8;&#x548C;&#x5F53;&#x521D; Windows &#x628A;&#x300C;&#x6211;&#x7684;&#x7535;&#x8111;&#x300D;(My Computer)&#x6539;&#x6210;&#x300C;&#x8BA1;&#x7B97;&#x673A;&#x300D;(Computer)&#x4E00;&#x6837;&#x5427;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x53BB;&#x6389;&#x300C;&#x6211;&#x7684;&#x300D;&#x6216;&#x8005;&#x300C;&#x4F60;&#x7684;&#x300D;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x6700;&#x4F18;&#x529E;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x66F4;&#x591A;&#x6B67;&#x4E49;&#x3002;&#x6709;&#x65F6;&#x4F60;&#x771F;&#x7684;&#x9700;&#x8981;&#x533A;&#x5206;&#x8FD9;&#x5230;&#x5E95;&#x662F;&#x8C01;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x5728; YouTube &#x4E0A;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x53EB;&#x300C;&#x9891;&#x9053;&#x300D;(Channel)&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E0D;&#x77E5;&#x9053;&#x6307;&#x7684;&#x662F;&#x4F60;&#x8BA2;&#x9605;&#x7684;&#x9891;&#x9053;&#xFF0C;&#x8FD8;&#x662F; YouTube &#x7ED9;&#x4F60;&#x63A8;&#x8350;&#x7684;&#x9891;&#x9053;&#x3002;</p>
<p><img src="../assets/design/is-this-my-interface-or-yours/7.png" style="width:90%"></p>
<p>&#x8FD9;&#x6216;&#x8BB8;&#xFF08;&#x53EA;&#x662F;&#x6216;&#x8BB8;&#xFF09;&#x662F; Windows &#x6700;&#x540E;&#x628A;&#x300C;&#x8BA1;&#x7B97;&#x673A;&#x300D;(Computer)&#x6539;&#x6210;&#x300C;&#x6B64;&#x7535;&#x8111;&#x300D;(This PC)&#x7684;&#x539F;&#x56E0;&#x5427;&#x3002;&#x56E0;&#x4E3A;&#x300C;&#x8BA1;&#x7B97;&#x673A;&#x300D;&#x672C;&#x8EAB;&#x5B9A;&#x4E49;&#x592A;&#x6A21;&#x62DF;&#x4E24;&#x53EF;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x660E;&#x786E;&#x7684;&#x6307;&#x51FA;&#x662F;<em>&#x8FD9;&#x53F0;</em>&#x7535;&#x8111;&#x3002;</p>
<h2 id="&#x7EFC;&#x5408;&#x8003;&#x8651;putting-it-all-into-perspective">&#x7EFC;&#x5408;&#x8003;&#x8651;(Putting it all into perspective)</h2>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x662F;&#x5728;&#x754C;&#x9762;&#x4E0A;&#x5C55;&#x793A;&#x5C5E;&#x4E8E;&#x4F60;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E3A;&#x7528;&#x6237;&#x8BBE;&#x8BA1;&#x6240;&#x9047;&#x5230;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x95EE;&#x9898;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#xFF1A;&#x6309;&#x94AE;&#x4E0A;&#x7684;&#x6587;&#x5B57;&#x5199;&#x4EC0;&#x4E48;&#xFF1F;&#x600E;&#x4E48;&#x8BF4;&#x660E;&#xFF1F;&#x9700;&#x8981;&#x653E;&#x5230;&#x8BBE;&#x7F6E;&#x91CC;&#x9762;&#x5417;&#xFF1F;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x559C;&#x6B22;&#x9075;&#x5FAA;&#x7684;&#x89C4;&#x5219;&#xFF1A;</p>
<ul>
<li><strong>&#x4F7F;&#x7528;&#x300C;&#x6211;&#x300D;&#x7684;&#x60C5;&#x51B5;</strong>&#xFF1A;&#x5728;&#x7528;&#x6237;&#x548C;&#x4EA7;&#x54C1;&#x4EA4;&#x4E92;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F7F;&#x7528;&#x6211;&#x3001;&#x6211;&#x7684;&#x3001;&#x5C5E;&#x4E8E;&#x6211;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x6216;&#x70B9;&#x6309;&#x590D;&#x9009;&#x6846;&#x7B49;&#x3002;&#x4F46;&#x53EA;&#x6709;&#x5728;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x660E;&#x786E;&#x8BF4;&#x660E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x80FD;&#x6DFB;&#x52A0;&#x8FD9;&#x4E9B;&#x8BCD;&#x3002;</li>
<li><strong>&#x4F7F;&#x7528;&#x300C;&#x4F60;&#x300D;&#x7684;&#x60C5;&#x51B5;</strong>&#xFF1A;&#x5728;&#x4EA7;&#x54C1;&#x5411;&#x7528;&#x6237;&#x63D0;&#x95EE;&#x3001;&#x63D0;&#x4F9B;&#x8BF4;&#x660E;&#x3001;&#x63CF;&#x8FF0;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F7F;&#x7528;&#x4F60;&#x3001;&#x4F60;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4E0B;&#x79C1;&#x4EBA;&#x52A9;&#x624B;&#x4F1A;&#x5BF9;&#x4F60;&#x8BF4;&#x4EC0;&#x4E48;&#x3002;</li>
</ul>
<p><img src="../assets/design/is-this-my-interface-or-yours/8.png" style="width:90%"></p>
<h2 id="&#x4ECE;&#x300C;&#x6211;&#x4EEC;&#x7684;&#x300D;&#x89D2;&#x5EA6;&#x8003;&#x8651;">&#x4ECE;&#x300C;&#x6211;&#x4EEC;&#x7684;&#x300D;&#x89D2;&#x5EA6;&#x8003;&#x8651;</h2>
<p>&#x5728;&#x6587;&#x7AE0;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x8FD8;&#x60F3;&#x63D0;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#xFF1A;&#x300C;&#x6211;&#x4EEC;&#x7684;&#x300D;&#x3002;&#x5373;&#x5728;&#x754C;&#x9762;&#x4E0A;&#x4F7F;&#x7528;&#x300C;&#x6211;&#x4EEC;&#x300D;&#xFF0C;&#x300C;&#x6211;&#x4EEC;&#x7684;&#x300D;&#x3002;</p>
<p><img src="../assets/design/is-this-my-interface-or-yours/9.png" style="width:90%"></p>
<p>&#x4F7F;&#x7528;&#x300C;&#x6211;&#x4EEC;&#x300D;&#xFF0C;&#x300C;&#x6211;&#x4EEC;&#x7684;&#x300D;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x4E0E;&#x8005; - &#x4EA7;&#x54C1;&#x80CC;&#x540E;&#x7684;&#x4EBA;&#x3002;&#x8FD9;&#x662F;&#x8868;&#x660E;&#x6709;&#x771F;&#x7684;&#x4EBA;&#x5728;&#x5F00;&#x53D1;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53EA;&#x6709;&#x4E00;&#x4E9B;&#x51B7;&#x51B0;&#x51B0;&#x7684;&#x7A0B;&#x5E8F;&#x673A;&#x5668;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#x662F;&#x63D0;&#x4F9B;&#x4EBA;&#x7C7B;&#x751F;&#x4EA7;&#x529B;&#x670D;&#x52A1;(people-powered services)&#x7684;&#xFF0C;&#x5982;&#x70F9;&#x996A;&#xFF0C;&#x8BBE;&#x8BA1;&#xFF0C;&#x6E05;&#x6D01;&#x7B49;&#xFF0C;&#x6DFB;&#x52A0;&#x300C;&#x6211;&#x4EEC;&#x300D;&#x5C31;&#x66F4;&#x6709;&#x4EBA;&#x60C5;&#x5473;&#x4E86;&#x3002;&#x300E;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x80FD;&#x5E2E;&#x5230;&#x4F60;&#x3002;&#x300F;&#xFF0C;&#x300E;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x3002;&#x300F;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x7528;&#x6237;&#x77E5;&#x9053;&#x771F;&#x6B63;&#x7684;&#x4EBA;&#x5C31;&#x5728;&#x8FD9;&#x4E9B;&#x6B7B;&#x677F;&#x7A97;&#x53E3;&#x548C;&#x63D0;&#x793A;&#x6846;&#x7684;&#x540E;&#x9762;&#x7B49;&#x7740;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x5F97;&#x4EE5;&#x653E;&#x677E;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#x662F;&#x50CF; Google &#x641C;&#x7D22;&#x5F15;&#x64CE;&#x8FD9;&#x6837;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#xFF0C;&#x300C;&#x6211;&#x4EEC;&#x300D;&#x8FD9;&#x4E2A;&#x8BCD;&#x5C31;&#x4F1A;&#x611F;&#x5230;&#x8BEF;&#x5BFC;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x771F;&#x7684;&#x4EBA;&#x6765;&#x5904;&#x7406;&#x4F60;&#x7684;&#x641C;&#x7D22;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;Google &#x7F16;&#x5199; &#x7684; UI &#x6307;&#x5357;&#x91CC;&#x9762;&#xFF0C;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x5728;&#x754C;&#x9762;&#x4E2D;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x7684;&#x4E8B;&#x60C5;&#x4F7F;&#x7528;&#x300C;&#x6211;&#x4EEC;&#x300D;&#x3002; </p>
<h2 id="&#x4F60;&#x7684;&#x8003;&#x8651;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;">&#x4F60;&#x7684;&#x8003;&#x8651;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h2>
<p>&#x6211;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x603B;&#x662F;&#x4E00;&#x6B21;&#x53C8;&#x4E00;&#x6B21;&#x7684;&#x51FA;&#x73B0;&#x5728;&#x8BBE;&#x8BA1;&#x5E08;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x6587;&#x6848;&#x7F16;&#x8F91;&#x8005;&#x8EAB;&#x4E0A;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x300C;&#x6211;&#x7684;&#x300D;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5728;&#x90A3;&#x91CC;&#x4F7F;&#x7528;&#x300C;&#x4F60;&#x7684;&#x300D;&#xFF1F;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x5F88;&#x5C11;&#x770B;&#x5230;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x6307;&#x5357;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8003;&#xFF0C;&#x4F60;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6307;&#x5357;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x6211;&#x5F88;&#x60F3;&#x542C;&#x542C;&#x4F60;&#x662F;&#x600E;&#x4E48;&#x8003;&#x8651;&#x7684;&#x3002;</p>
<p><img src="../assets/design/is-this-my-interface-or-yours/10.png" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../design.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Design">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"这界面是我的还是你的？","level":"1.6.1","depth":2,"previous":{"title":"Design","level":"1.6","depth":1,"path":"design.md","ref":"design.md","articles":[{"title":"这界面是我的还是你的？","level":"1.6.1","depth":2,"path":"design/is-this-my-interface-or-yours.md","ref":"design/is-this-my-interface-or-yours.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-sharing","livereload"],"styles":{"website":"styles/website.css"},"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Alex Tse","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"iOS 教程, iOS Tutorial","links":{"sidebar":{"Alex Tse":"https://github.com/ixiemin/iOS-Tutorial"}},"gitbook":"*","description":"iOS 教程, iOS Tutorial"},"file":{"path":"design/is-this-my-interface-or-yours.md","mtime":"2017-09-18T07:49:34.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2017-09-18T08:03:16.203Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

